<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Recipe description</string>
	<key>Identifier</key>
	<string>com.github.iancohn.download.DellBios-Win</string>
	<key>Input</key>
	<dict>
		<key>FAMILY</key>
		<string>Optiplex</string>
		<key>MODEL</key>
		<string>5090</string>
		<key>FORM_FACTOR</key>
		<string>Desktop</string>
		<key>CONTINUE_ON_CODESIGN_FAIL</key>
		<string>False</string>
		<key>PRODUCT_CODE_OVERRIDE</key>
		<string/>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>com.github.iancohn.SharedProcessors/DellSoftwareUrlProvider</string>
			<key>Arguments</key>
			<dict>
				<key>FILE_TYPE</key>
				<string>BEW</string>
				<key>OS_CODE</key>
				<string>BIOSA</string>
				<key>POPULATE_CVES</key>
				<true/>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>curl_opts</key>
				<dict/>
				<key>request_headers</key>
				<dict>
					<key>User-Agent</key>
					<string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/104.0.5112.102 Safari/537.36</string>
				</dict>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>com.github.iancohn.SharedProcessors/VirusTotalAnalyzerV3</string>
			<key>Arguments</key>
			<dict>
				<key>code_sign_verification_config</key>
				<dict>
					<key>continue_on_failure</key>
					<string>%CONTINUE_ON_CODESIGN_FAIL%</string>
					<key>code_signing_checks</key>
					<dict>
						<key>expected_authority_names</key>
						<array>
							<string>Dell Inc</string>
							<string>Entrust Code Signing CA - OVCS2</string>
							<string>Entrust Code Signing Root Certification Authority - CSBR1</string>
							<string>Entrust.net</string>
						</array>
					</dict>
				</dict>
			</dict>
		</dict>
	</array>
</dict>
</plist>
