Description: |
  This is a template recipe which will create a directory containing the PSAppDeployToolkit 
  framework and files and can be adapter to place any required files into the files directory.
Identifier: com.github.iancohn.pkg.PSADTApp.AppName
MinimumVersion: 2.3.0
#ParentRecipe: com.here.recipe.download.your

Input:
  NAME: "SAMPLE" 
  PSADT_TOOLKIT_VERSION: 4.1.3
  PSADT_APP_ARCH: "" #| # Make this argument an empty string if not using.
  PSADT_APP_VENDOR: "" #| # Make this argument an empty string if not using.
  PSADT_APP_NAME: "" #| # Make this argument an empty string if not using.
  PSADT_TEMPLATE_ZIP_PATH: "%RECIPE_DIR%/../../com.github.autopkg.iancohn-recipes/PsAppDeployToolkit/Templates/4.1.3/PSAppDeployToolkit_Template_v4.zip"
  PSADT_INVOKE_SCRIPT_TEMPLATE_PATH: "%RECIPE_DIR%/../../com.github.autopkg.iancohn-recipes/PsAppDeployToolkit/Templates/4.1.3/Invoke-AppDeployToolkit.ps1"
  PSADT_CUSTOM_PARAMETERS: "" #| # Make this an empty string if not using.
#    [Parameter(Mandatory = $false)]
#    [System.Management.Automation.SwitchParameter]$SampleParameter,
  PSADT_CLOSE_APPS: "" #Example: @('excel', @{ Name = 'winword'; Description = 'Microsoft Word' })
  PSADT_SCRIPT_VERSION: '0.0.1'
  PSADT_SCRIPT_DATE: '2025-01-01'
  PSADT_SCRIPT_AUTHOR: 'AutoPkg'
  PSADT_REQUIRE_ADMIN: '$true'
  PSADT_PRE_INSTALL_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "Pre-Install Stuff"
  PSADT_INSTALL_TASKS: | # Make this argument an empty string if not using.
    Write-ADTLogEntry -Message "Installing Application"
  PSADT_POST_INSTALL_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "PostInstall Stuff"
  PSADT_CUSTOM_INSTALL_COMPLETE_COMMAND: "" # If using this argument, end it with "`n        # ", otherwise set it to an empty string
  PSADT_PRE_REPAIR_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "Pre-Install Stuff"
  PSADT_REPAIR_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "Install Stuff"
  PSADT_POST_REPAIR_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "PostInstall Stuff"
  PSADT_CUSTOM_REPAIR_COMPLETE_COMMAND: "" # If using this argument, end it with "`n        # ", otherwise set it to an empty string
  PSADT_PRE_UNINSTALL_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "Pre-Install Stuff"
  PSADT_UNINSTALL_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "Install Stuff"
  PSADT_POST_UNINSTALL_TASKS: "" #| # Make this argument an empty string if not using.
#    Write-ADTLogEntry -Message "PostInstall Stuff"
  PSADT_CUSTOM_UNINSTALL_COMPLETE_COMMAND: "" # If using this argument, end it with "`n        # ", otherwise set it to an empty string
Process:
- Processor: StopProcessingIf
  Arguments:
    x64Path: "%pathname%"
    predicate: |
      download_changed == FALSE
- Processor: StopProcessingIf
  Arguments:
    predicate: |
      download_changed == FALSE
- Processor: StopProcessingIf
  Arguments:
    predicate: |
      version == "" OR version == "None"
- Processor: Unarchiver
  Arguments:
    archive_path: "%PSADT_TEMPLATE_ZIP_PATH%"
    purge_destination: true
- Processor: PathDeleter
  Arguments:
    path_list: 
    - "%RECIPE_CACHE_DIR%/%NAME%/Invoke-AppDeployToolkit.ps1"
    version: 1.4.4
- Processor: com.github.scriptingosx.SharedProcessors/FileTemplate
  Arguments:
    template_path: "%PSADT_INVOKE_SCRIPT_TEMPLATE_PATH%"
    destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Invoke-AppDeployToolkit.ps1"
- Processor: Copier
  Arguments:
    source_path: '%pathname%'
    destination_path: "%RECIPE_CACHE_DIR%/%NAME%/Files"