<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>This recipe downloads the latest OneDrive Sync application for Windows from Microsoft.</string>
    <key>Identifier</key>
    <string>com.github.iancohn.download.OneDrive-Win</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OneDrive</string>
        <key>USER_AGENT</key>
        <string>Mozilla/5.0 (Windows NT 6.3; Win64, x64; Trident/7.0; rv:11.0) like Gecko</string>
        <key>url</key>
        <string>https://go.microsoft.com/fwlink/?linkid=844652</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%url%</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>%USER_AGENT%</string>
                </dict>
                <key>prefetch_filename</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>com.github.hansen-m.SharedProcessors/WinInstallerExtractor</string>
            <key>Arguments</key>
            <dict/>
        </dict>
        <dict>
            <key>Processor</key>
            <string>StopProcessingIf</string>
            <key>Arguments</key>
            <dict>
                <key>predicate</key>
                <string>version == "" OR version == "None" </string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
